RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_rdc_regs.h
/*
 * ACC_EN (RW)
 *
 * Enable rdc accumulate
 * 0: rdc disable
 * 1: rdc enable
 */
#define RDC_RDC_CTL_ACC_EN_MASK (0x4U)
#define RDC_RDC_CTL_ACC_EN_SHIFT (2U)
#define RDC_RDC_CTL_ACC_EN_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_ACC_EN_SHIFT) & RDC_RDC_CTL_ACC_EN_MASK)
#define RDC_RDC_CTL_ACC_EN_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_ACC_EN_MASK) >> RDC_RDC_CTL_ACC_EN_SHIFT)

/*
 * EXC_START (RW1C)
 *
 * Write 1 start excite signal, always read 0
 * 0: no effect
 * 1: start excite signal
 */
#define RDC_RDC_CTL_EXC_START_MASK (0x2U)
#define RDC_RDC_CTL_EXC_START_SHIFT (1U)
#define RDC_RDC_CTL_EXC_START_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_EXC_START_SHIFT) & RDC_RDC_CTL_EXC_START_MASK)
#define RDC_RDC_CTL_EXC_START_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_EXC_START_MASK) >> RDC_RDC_CTL_EXC_START_SHIFT)

/*
 * EXC_EN (RW)
 *
 * Enable rdc excite signal
 * 0: rdc disable
 * 1: rdc enable
 */
#define RDC_RDC_CTL_EXC_EN_MASK (0x1U)
#define RDC_RDC_CTL_EXC_EN_SHIFT (0U)
#define RDC_RDC_CTL_EXC_EN_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_EXC_EN_SHIFT) & RDC_RDC_CTL_EXC_EN_MASK)
#define RDC_RDC_CTL_EXC_EN_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_EXC_EN_MASK) >> RDC_RDC_CTL_EXC_EN_SHIFT)

/* Bitfield definition for register: ACC_I */
/*
 * ACC (RO)
 *
 * accumulate result of i_channel, this is a signed number
 */
#define RDC_ACC_I_ACC_MASK (0xFFFFFFFFUL)
#define RDC_ACC_I_ACC_SHIFT (0U)
#define RDC_ACC_I_ACC_GET(x) (((uint32_t)(x) & RDC_ACC_I_ACC_MASK) >> RDC_ACC_I_ACC_SHIFT)

/* Bitfield definition for register: ACC_Q */
/*
 * ACC (RO)
 *
 * accumulate result of q_channel, this is a signed number
 */
#define RDC_ACC_Q_ACC_MASK (0xFFFFFFFFUL)
#define RDC_ACC_Q_ACC_SHIFT (0U)
#define RDC_ACC_Q_ACC_GET(x) (((uint32_t)(x) & RDC_ACC_Q_ACC_MASK) >> RDC_ACC_Q_ACC_SHIFT)

/* Bitfield definition for register: IN_CTL */
/*
 * PORT_Q_SEL (RW)
 *
 * Input port selection for q_channel,
 * 0:sel port0
 * 1:sel port1
 */
#define RDC_IN_CTL_PORT_Q_SEL_MASK (0x100000UL)
#define RDC_IN_CTL_PORT_Q_SEL_SHIFT (20U)
#define RDC_IN_CTL_PORT_Q_SEL_SET(x) (((uint32_t)(x) << RDC_IN_CTL_PORT_Q_SEL_SHIFT) & RDC_IN_CTL_PORT_Q_SEL_MASK)
#define RDC_IN_CTL_PORT_Q_SEL_GET(x) (((uint32_t)(x) & RDC_IN_CTL_PORT_Q_SEL_MASK) >> RDC_IN_CTL_PORT_Q_SEL_SHIFT)

/*
 * CH_Q_SEL (RW)
 *
 * Input channel selection for q_channel
 * 0: channel 0 selected
 * 1: channel 1 selected
 * …
 * 31: channel 31 selected
 */
#define RDC_IN_CTL_CH_Q_SEL_MASK (0x1F000UL)
#define RDC_IN_CTL_CH_Q_SEL_SHIFT (12U)
#define RDC_IN_CTL_CH_Q_SEL_SET(x) (((uint32_t)(x) << RDC_IN_CTL_CH_Q_SEL_SHIFT) & RDC_IN_CTL_CH_Q_SEL_MASK)
#define RDC_IN_CTL_CH_Q_SEL_GET(x) (((uint32_t)(x) & RDC_IN_CTL_CH_Q_SEL_MASK) >> RDC_IN_CTL_CH_Q_SEL_SHIFT)

/*
 * PORT_I_SEL (RW)
 *
 * Input port selection for i_channel,
 * 0:sel port0
 * 1:sel port1
 */
#define RDC_IN_CTL_PORT_I_SEL_MASK (0x100U)
#define RDC_IN_CTL_PORT_I_SEL_SHIFT (8U)
#define RDC_IN_CTL_PORT_I_SEL_SET(x) (((uint32_t)(x) << RDC_IN_CTL_PORT_I_SEL_SHIFT) & RDC_IN_CTL_PORT_I_SEL_MASK)
#define RDC_IN_CTL_PORT_I_SEL_GET(x) (((uint32_t)(x) & RDC_IN_CTL_PORT_I_SEL_MASK) >> RDC_IN_CTL_PORT_I_SEL_SHIFT)

/*
 * CH_I_SEL (RW)
 *
 * Input channel selection for i_channel
 * 0: channel 0 selected
 * 1: channel 1 selected
 * …
 * 31: channel 31 selected
 */
#define RDC_IN_CTL_CH_I_SEL_MASK (0x1FU)
#define RDC_IN_CTL_CH_I_SEL_SHIFT (0U)
#define RDC_IN_CTL_CH_I_SEL_SET(x) (((uint32_t)(x) << RDC_IN_CTL_CH_I_SEL_SHIFT) & RDC_IN_CTL_CH_I_SEL_MASK)
#define RDC_IN_CTL_CH_I_SEL_GET(x) (((uint32_t)(x) & RDC_IN_CTL_CH_I_SEL_MASK) >> RDC_IN_CTL_CH_I_SEL_SHIFT)

/* Bitfield definition for register: OUT_CTL */
/*
 * CH_Q_SEL (RW)
 *
 * Output channel selection for q_channel
 */
#define RDC_OUT_CTL_CH_Q_SEL_MASK (0x1F00U)
#define RDC_OUT_CTL_CH_Q_SEL_SHIFT (8U)
#define RDC_OUT_CTL_CH_Q_SEL_SET(x) (((uint32_t)(x) << RDC_OUT_CTL_CH_Q_SEL_SHIFT) & RDC_OUT_CTL_CH_Q_SEL_MASK)
#define RDC_OUT_CTL_CH_Q_SEL_GET(x) (((uint32_t)(x) & RDC_OUT_CTL_CH_Q_SEL_MASK) >> RDC_OUT_CTL_CH_Q_SEL_SHIFT)

/*
 * CH_I_SEL (RW)
 *
 * Output channel selection for i_channel
 */
#define RDC_OUT_CTL_CH_I_SEL_MASK (0x1FU)
#define RDC_OUT_CTL_CH_I_SEL_SHIFT (0U)
#define RDC_OUT_CTL_CH_I_SEL_SET(x) (((uint32_t)(x) << RDC_OUT_CTL_CH_I_SEL_SHIFT) & RDC_OUT_CTL_CH_I_SEL_MASK)
#define RDC_OUT_CTL_CH_I_SEL_GET(x) (((uint32_t)(x) & RDC_OUT_CTL_CH_I_SEL_MASK) >> RDC_OUT_CTL_CH_I_SEL_SHIFT)

/* Bitfield definition for register: EXC_TIMMING */
/*
 * SWAP (RW)
 *
 * Swap output of PWM and DAC
 * 0: disable swap
 * 1: swap output
 */
#define RDC_EXC_TIMMING_SWAP_MASK (0x1000000UL)
#define RDC_EXC_TIMMING_SWAP_SHIFT (24U)
#define RDC_EXC_TIMMING_SWAP_SET(x) (((uint32_t)(x) << RDC_EXC_TIMMING_SWAP_SHIFT) & RDC_EXC_TIMMING_SWAP_MASK)
#define RDC_EXC_TIMMING_SWAP_GET(x) (((uint32_t)(x) & RDC_EXC_TIMMING_SWAP_MASK) >> RDC_EXC_TIMMING_SWAP_SHIFT)

/*
 * PWM_PRD (RW)
 *
 * Pwm period in samples，
 * 0：1 sample period
 * 1:   2 sample period
 * ...
 * 15: 16 sample period
 */
#define RDC_EXC_TIMMING_PWM_PRD_MASK (0xF00000UL)
#define RDC_EXC_TIMMING_PWM_PRD_SHIFT (20U)
#define RDC_EXC_TIMMING_PWM_PRD_SET(x) (((uint32_t)(x) << RDC_EXC_TIMMING_PWM_PRD_SHIFT) & RDC_EXC_TIMMING_PWM_PRD_MASK)
#define RDC_EXC_TIMMING_PWM_PRD_GET(x) (((uint32_t)(x) & RDC_EXC_TIMMING_PWM_PRD_MASK) >> RDC_EXC_TIMMING_PWM_PRD_SHIFT)

/*
 * SMP_NUM (RW)
 *
 * Number of sample every excitation period
 * 0: 4 point
 * 1: 8 point
 * …
 * 8: 1024 point
 */
#define RDC_EXC_TIMMING_SMP_NUM_MASK (0xF0000UL)
#define RDC_EXC_TIMMING_SMP_NUM_SHIFT (16U)
#define RDC_EXC_TIMMING_SMP_NUM_SET(x) (((uint32_t)(x) << RDC_EXC_TIMMING_SMP_NUM_SHIFT) & RDC_EXC_TIMMING_SMP_NUM_MASK)
#define RDC_EXC_TIMMING_SMP_NUM_GET(x) (((uint32_t)(x) & RDC_EXC_TIMMING_SMP_NUM_MASK) >> RDC_EXC_TIMMING_SMP_NUM_SHIFT)

/*
 * SMP_RATE (RW)
 *
 * The period for excitation sample in clock cycle，
 * 0: not allowed
 * 1: 1 cycle
 * 2: 2 cycles
 * …
 * 65535 : 65535 cycles
 */
#define RDC_EXC_TIMMING_SMP_RATE_MASK (0xFFFFU)
#define RDC_EXC_TIMMING_SMP_RATE_SHIFT (0U)
#define RDC_EXC_TIMMING_SMP_RATE_SET(x) (((uint32_t)(x) << RDC_EXC_TIMMING_SMP_RATE_SHIFT) & RDC_EXC_TIMMING_SMP_RATE_MASK)
#define RDC_EXC_TIMMING_SMP_RATE_GET(x) (((uint32_t)(x) & RDC_EXC_TIMMING_SMP_RATE_MASK) >> RDC_EXC_TIMMING_SMP_RATE_SHIFT)

