RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_rdc_regs.h
/* Bitfield definition for register: EXC_SCALING */
/*
 * AMP_EXP (RW)
 *
 * Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp
 */
#define RDC_EXC_SCALING_AMP_EXP_MASK (0xF0U)
#define RDC_EXC_SCALING_AMP_EXP_SHIFT (4U)
#define RDC_EXC_SCALING_AMP_EXP_SET(x) (((uint32_t)(x) << RDC_EXC_SCALING_AMP_EXP_SHIFT) & RDC_EXC_SCALING_AMP_EXP_MASK)
#define RDC_EXC_SCALING_AMP_EXP_GET(x) (((uint32_t)(x) & RDC_EXC_SCALING_AMP_EXP_MASK) >> RDC_EXC_SCALING_AMP_EXP_SHIFT)

/*
 * AMP_MAN (RW)
 *
 * Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp
 */
#define RDC_EXC_SCALING_AMP_MAN_MASK (0xFU)
#define RDC_EXC_SCALING_AMP_MAN_SHIFT (0U)
#define RDC_EXC_SCALING_AMP_MAN_SET(x) (((uint32_t)(x) << RDC_EXC_SCALING_AMP_MAN_SHIFT) & RDC_EXC_SCALING_AMP_MAN_MASK)
#define RDC_EXC_SCALING_AMP_MAN_GET(x) (((uint32_t)(x) & RDC_EXC_SCALING_AMP_MAN_MASK) >> RDC_EXC_SCALING_AMP_MAN_SHIFT)

/* Bitfield definition for register: EXC_OFFSET */
/*
 * AMP_OFFSET (RW)
 *
 * Offset for excitation
 */
#define RDC_EXC_OFFSET_AMP_OFFSET_MASK (0xFFFFFFUL)
#define RDC_EXC_OFFSET_AMP_OFFSET_SHIFT (0U)
#define RDC_EXC_OFFSET_AMP_OFFSET_SET(x) (((uint32_t)(x) << RDC_EXC_OFFSET_AMP_OFFSET_SHIFT) & RDC_EXC_OFFSET_AMP_OFFSET_MASK)
#define RDC_EXC_OFFSET_AMP_OFFSET_GET(x) (((uint32_t)(x) & RDC_EXC_OFFSET_AMP_OFFSET_MASK) >> RDC_EXC_OFFSET_AMP_OFFSET_SHIFT)

/* Bitfield definition for register: PWM_SCALING */
/*
 * N_POL (RW)
 *
 * Polarity of exc_n signal
 * 0: high active
 * 1: low active
 */
#define RDC_PWM_SCALING_N_POL_MASK (0x2000U)
#define RDC_PWM_SCALING_N_POL_SHIFT (13U)
#define RDC_PWM_SCALING_N_POL_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_N_POL_SHIFT) & RDC_PWM_SCALING_N_POL_MASK)
#define RDC_PWM_SCALING_N_POL_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_N_POL_MASK) >> RDC_PWM_SCALING_N_POL_SHIFT)

/*
 * P_POL (RW)
 *
 * Polarity of exc_p signal
 * 0: high active
 * 1: low active
 */
#define RDC_PWM_SCALING_P_POL_MASK (0x1000U)
#define RDC_PWM_SCALING_P_POL_SHIFT (12U)
#define RDC_PWM_SCALING_P_POL_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_P_POL_SHIFT) & RDC_PWM_SCALING_P_POL_MASK)
#define RDC_PWM_SCALING_P_POL_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_P_POL_MASK) >> RDC_PWM_SCALING_P_POL_SHIFT)

/*
 * DITHER (RW)
 *
 * Enable dither of pwm
 * 0: disable
 * 1: enable
 */
#define RDC_PWM_SCALING_DITHER_MASK (0x100U)
#define RDC_PWM_SCALING_DITHER_SHIFT (8U)
#define RDC_PWM_SCALING_DITHER_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_DITHER_SHIFT) & RDC_PWM_SCALING_DITHER_MASK)
#define RDC_PWM_SCALING_DITHER_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_DITHER_MASK) >> RDC_PWM_SCALING_DITHER_SHIFT)

/*
 * AMP_EXP (RW)
 *
 * Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp
 */
#define RDC_PWM_SCALING_AMP_EXP_MASK (0xF0U)
#define RDC_PWM_SCALING_AMP_EXP_SHIFT (4U)
#define RDC_PWM_SCALING_AMP_EXP_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_AMP_EXP_SHIFT) & RDC_PWM_SCALING_AMP_EXP_MASK)
#define RDC_PWM_SCALING_AMP_EXP_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_AMP_EXP_MASK) >> RDC_PWM_SCALING_AMP_EXP_SHIFT)

/*
 * AMP_MAN (RW)
 *
 * Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp
 */
#define RDC_PWM_SCALING_AMP_MAN_MASK (0xFU)
#define RDC_PWM_SCALING_AMP_MAN_SHIFT (0U)
#define RDC_PWM_SCALING_AMP_MAN_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_AMP_MAN_SHIFT) & RDC_PWM_SCALING_AMP_MAN_MASK)
#define RDC_PWM_SCALING_AMP_MAN_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_AMP_MAN_MASK) >> RDC_PWM_SCALING_AMP_MAN_SHIFT)

/* Bitfield definition for register: PWM_OFFSET */
/*
 * AMP_OFFSET (RW)
 *
 * Offset for excitation
 */
#define RDC_PWM_OFFSET_AMP_OFFSET_MASK (0xFFFFFFUL)
#define RDC_PWM_OFFSET_AMP_OFFSET_SHIFT (0U)
#define RDC_PWM_OFFSET_AMP_OFFSET_SET(x) (((uint32_t)(x) << RDC_PWM_OFFSET_AMP_OFFSET_SHIFT) & RDC_PWM_OFFSET_AMP_OFFSET_MASK)
#define RDC_PWM_OFFSET_AMP_OFFSET_GET(x) (((uint32_t)(x) & RDC_PWM_OFFSET_AMP_OFFSET_MASK) >> RDC_PWM_OFFSET_AMP_OFFSET_SHIFT)

/* Bitfield definition for register: TRIG_OUT0_CFG */
/*
 * ENABLE (RW)
 *
 * Enable trigger out0
 * 0: disable
 * 1: enable
 */
#define RDC_TRIG_OUT0_CFG_ENABLE_MASK (0x100000UL)
#define RDC_TRIG_OUT0_CFG_ENABLE_SHIFT (20U)
#define RDC_TRIG_OUT0_CFG_ENABLE_SET(x) (((uint32_t)(x) << RDC_TRIG_OUT0_CFG_ENABLE_SHIFT) & RDC_TRIG_OUT0_CFG_ENABLE_MASK)
#define RDC_TRIG_OUT0_CFG_ENABLE_GET(x) (((uint32_t)(x) & RDC_TRIG_OUT0_CFG_ENABLE_MASK) >> RDC_TRIG_OUT0_CFG_ENABLE_SHIFT)

/*
 * LEAD_TIM (RW)
 *
 * Lead time for trigger out0 from center of low level , this is a signed value
 * …
 * 2: 2 cycle befor center of low level
 * 1: 1 cycle before center of low level
 * 0: center of low level
 * -1: 1cycle after center of low level
 * -2: 2cycle after center of low level
 */
#define RDC_TRIG_OUT0_CFG_LEAD_TIM_MASK (0xFFFFFUL)
#define RDC_TRIG_OUT0_CFG_LEAD_TIM_SHIFT (0U)
#define RDC_TRIG_OUT0_CFG_LEAD_TIM_SET(x) (((uint32_t)(x) << RDC_TRIG_OUT0_CFG_LEAD_TIM_SHIFT) & RDC_TRIG_OUT0_CFG_LEAD_TIM_MASK)
#define RDC_TRIG_OUT0_CFG_LEAD_TIM_GET(x) (((uint32_t)(x) & RDC_TRIG_OUT0_CFG_LEAD_TIM_MASK) >> RDC_TRIG_OUT0_CFG_LEAD_TIM_SHIFT)

/* Bitfield definition for register: TRIG_OUT1_CFG */
/*
 * ENABLE (RW)
 *
 * Enable trigger out1
 * 0: disable
 * 1: enable
 */
#define RDC_TRIG_OUT1_CFG_ENABLE_MASK (0x100000UL)
#define RDC_TRIG_OUT1_CFG_ENABLE_SHIFT (20U)
#define RDC_TRIG_OUT1_CFG_ENABLE_SET(x) (((uint32_t)(x) << RDC_TRIG_OUT1_CFG_ENABLE_SHIFT) & RDC_TRIG_OUT1_CFG_ENABLE_MASK)
#define RDC_TRIG_OUT1_CFG_ENABLE_GET(x) (((uint32_t)(x) & RDC_TRIG_OUT1_CFG_ENABLE_MASK) >> RDC_TRIG_OUT1_CFG_ENABLE_SHIFT)

/*
 * LEAD_TIM (RW)
 *
 * Lead time for trigger out0 from center of hight level , this is a signed value
 * …
 * 2: 2 cycle befor center of hight level
 * 1: 1 cycle before center of hight level
 * 0: center of hight level
 * -1: 1cycle after center of hight level
 * -2: 2cycle after center of hight level
 */
#define RDC_TRIG_OUT1_CFG_LEAD_TIM_MASK (0xFFFFFUL)
#define RDC_TRIG_OUT1_CFG_LEAD_TIM_SHIFT (0U)
#define RDC_TRIG_OUT1_CFG_LEAD_TIM_SET(x) (((uint32_t)(x) << RDC_TRIG_OUT1_CFG_LEAD_TIM_SHIFT) & RDC_TRIG_OUT1_CFG_LEAD_TIM_MASK)
#define RDC_TRIG_OUT1_CFG_LEAD_TIM_GET(x) (((uint32_t)(x) & RDC_TRIG_OUT1_CFG_LEAD_TIM_MASK) >> RDC_TRIG_OUT1_CFG_LEAD_TIM_SHIFT)

/* Bitfield definition for register: PWM_DZ */
/*
 * DZ_N (RW)
 *
 * Exc_n dead zone  in clock cycle before swap
 * 0: no dead zone
 * 1: 1 cycle dead zone
 * 2: 2 cycle dead zone
 * …
 */
#define RDC_PWM_DZ_DZ_N_MASK (0xFF00U)
#define RDC_PWM_DZ_DZ_N_SHIFT (8U)
#define RDC_PWM_DZ_DZ_N_SET(x) (((uint32_t)(x) << RDC_PWM_DZ_DZ_N_SHIFT) & RDC_PWM_DZ_DZ_N_MASK)
#define RDC_PWM_DZ_DZ_N_GET(x) (((uint32_t)(x) & RDC_PWM_DZ_DZ_N_MASK) >> RDC_PWM_DZ_DZ_N_SHIFT)

