RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_rdc_regs.h
/*
 * DZ_P (RW)
 *
 * Exc_p dead zone  in clock cycle before swap
 * 0: no dead zone
 * 1: 1 cycle dead zone
 * 2: 2 cycle dead zone
 * …
 */
#define RDC_PWM_DZ_DZ_P_MASK (0xFFU)
#define RDC_PWM_DZ_DZ_P_SHIFT (0U)
#define RDC_PWM_DZ_DZ_P_SET(x) (((uint32_t)(x) << RDC_PWM_DZ_DZ_P_SHIFT) & RDC_PWM_DZ_DZ_P_MASK)
#define RDC_PWM_DZ_DZ_P_GET(x) (((uint32_t)(x) & RDC_PWM_DZ_DZ_P_MASK) >> RDC_PWM_DZ_DZ_P_SHIFT)

/* Bitfield definition for register: SYNC_OUT_CTRL */
/*
 * PWM_OUT_DLY (RO)
 *
 * Delay bettween the delyed trigger and the first pwm pulse in clock cycle
 * 1: 1 cycle
 * 2: 2 cycle
 * …
 */
#define RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_MASK (0xFFFF0000UL)
#define RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_SHIFT (16U)
#define RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_GET(x) (((uint32_t)(x) & RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_MASK) >> RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_SHIFT)

/*
 * MIN2TRIG_EN (RW)
 *
 * Enable trigger out from the min point of exciting signal
 * 1: enable
 * 0: disable
 */
#define RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_MASK (0x20U)
#define RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_SHIFT (5U)
#define RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_SET(x) (((uint32_t)(x) << RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_SHIFT) & RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_MASK)
#define RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_GET(x) (((uint32_t)(x) & RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_MASK) >> RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_SHIFT)

/*
 * MAX2TRIG_EN (RW)
 *
 * Enable trigger out from the max point of exciting signal
 * 1: enable
 * 0: disable
 */
#define RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_MASK (0x10U)
#define RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_SHIFT (4U)
#define RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_SET(x) (((uint32_t)(x) << RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_SHIFT) & RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_MASK)
#define RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_GET(x) (((uint32_t)(x) & RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_MASK) >> RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_SHIFT)

/*
 * SYNC_OUT_SEL (RW)
 *
 * Select output synchornize signal
 * 0: 0 phase of internal exciting signal
 * 1: 90 phase of internal exciting signal
 * 2: 180 phase of internal exciting signal
 * 3: 270 phase of internal exciting signal
 */
#define RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_MASK (0x3U)
#define RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_SHIFT (0U)
#define RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_SET(x) (((uint32_t)(x) << RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_SHIFT) & RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_MASK)
#define RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_GET(x) (((uint32_t)(x) & RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_MASK) >> RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_SHIFT)

/* Bitfield definition for register: EXC_SYNC_DLY */
/*
 * DISABLE (RW)
 *
 * Disable hardware trigger input
 * 0: enable
 * 1: disable
 */
#define RDC_EXC_SYNC_DLY_DISABLE_MASK (0x1000000UL)
#define RDC_EXC_SYNC_DLY_DISABLE_SHIFT (24U)
#define RDC_EXC_SYNC_DLY_DISABLE_SET(x) (((uint32_t)(x) << RDC_EXC_SYNC_DLY_DISABLE_SHIFT) & RDC_EXC_SYNC_DLY_DISABLE_MASK)
#define RDC_EXC_SYNC_DLY_DISABLE_GET(x) (((uint32_t)(x) & RDC_EXC_SYNC_DLY_DISABLE_MASK) >> RDC_EXC_SYNC_DLY_DISABLE_SHIFT)

/*
 * DELAY (RW)
 *
 * Trigger in delay timming in bus cycle from rising edge of trigger signal
 * 0:   1 cycle
 * 1:  2 cycle
 * …
 * 0xffffff:  2^24 cycle
 */
#define RDC_EXC_SYNC_DLY_DELAY_MASK (0xFFFFFFUL)
#define RDC_EXC_SYNC_DLY_DELAY_SHIFT (0U)
#define RDC_EXC_SYNC_DLY_DELAY_SET(x) (((uint32_t)(x) << RDC_EXC_SYNC_DLY_DELAY_SHIFT) & RDC_EXC_SYNC_DLY_DELAY_MASK)
#define RDC_EXC_SYNC_DLY_DELAY_GET(x) (((uint32_t)(x) & RDC_EXC_SYNC_DLY_DELAY_MASK) >> RDC_EXC_SYNC_DLY_DELAY_SHIFT)

/* Bitfield definition for register: MAX_I */
/*
 * MAX (RWC)
 *
 * Max value of  i_channel, write clear
 */
#define RDC_MAX_I_MAX_MASK (0xFFFFFF00UL)
#define RDC_MAX_I_MAX_SHIFT (8U)
#define RDC_MAX_I_MAX_SET(x) (((uint32_t)(x) << RDC_MAX_I_MAX_SHIFT) & RDC_MAX_I_MAX_MASK)
#define RDC_MAX_I_MAX_GET(x) (((uint32_t)(x) & RDC_MAX_I_MAX_MASK) >> RDC_MAX_I_MAX_SHIFT)

/*
 * VALID (RWC)
 *
 * Max value valid, write clear
 * 0: max value is not valid
 * 1: max value is valid
 */
#define RDC_MAX_I_VALID_MASK (0x1U)
#define RDC_MAX_I_VALID_SHIFT (0U)
#define RDC_MAX_I_VALID_SET(x) (((uint32_t)(x) << RDC_MAX_I_VALID_SHIFT) & RDC_MAX_I_VALID_MASK)
#define RDC_MAX_I_VALID_GET(x) (((uint32_t)(x) & RDC_MAX_I_VALID_MASK) >> RDC_MAX_I_VALID_SHIFT)

/* Bitfield definition for register: MIN_I */
/*
 * MIN (RWC)
 *
 * Min value of  i_channel, write clear
 */
#define RDC_MIN_I_MIN_MASK (0xFFFFFF00UL)
#define RDC_MIN_I_MIN_SHIFT (8U)
#define RDC_MIN_I_MIN_SET(x) (((uint32_t)(x) << RDC_MIN_I_MIN_SHIFT) & RDC_MIN_I_MIN_MASK)
#define RDC_MIN_I_MIN_GET(x) (((uint32_t)(x) & RDC_MIN_I_MIN_MASK) >> RDC_MIN_I_MIN_SHIFT)

/*
 * VALID (RWC)
 *
 * Min value valid, write clear
 * 0: min value is not valid
 * 1: min value is valid
 */
#define RDC_MIN_I_VALID_MASK (0x1U)
#define RDC_MIN_I_VALID_SHIFT (0U)
#define RDC_MIN_I_VALID_SET(x) (((uint32_t)(x) << RDC_MIN_I_VALID_SHIFT) & RDC_MIN_I_VALID_MASK)
#define RDC_MIN_I_VALID_GET(x) (((uint32_t)(x) & RDC_MIN_I_VALID_MASK) >> RDC_MIN_I_VALID_SHIFT)

/* Bitfield definition for register: MAX_Q */
/*
 * MAX (RWC)
 *
 * Max value of  q_channel, write clear
 */
#define RDC_MAX_Q_MAX_MASK (0xFFFFFF00UL)
#define RDC_MAX_Q_MAX_SHIFT (8U)
#define RDC_MAX_Q_MAX_SET(x) (((uint32_t)(x) << RDC_MAX_Q_MAX_SHIFT) & RDC_MAX_Q_MAX_MASK)
#define RDC_MAX_Q_MAX_GET(x) (((uint32_t)(x) & RDC_MAX_Q_MAX_MASK) >> RDC_MAX_Q_MAX_SHIFT)

/*
 * VALID (RWC)
 *
 * Max value valid, write clear
 * 0: max value is not valid
 * 1: max value is valid
 */
#define RDC_MAX_Q_VALID_MASK (0x1U)
#define RDC_MAX_Q_VALID_SHIFT (0U)
#define RDC_MAX_Q_VALID_SET(x) (((uint32_t)(x) << RDC_MAX_Q_VALID_SHIFT) & RDC_MAX_Q_VALID_MASK)
#define RDC_MAX_Q_VALID_GET(x) (((uint32_t)(x) & RDC_MAX_Q_VALID_MASK) >> RDC_MAX_Q_VALID_SHIFT)

/* Bitfield definition for register: MIN_Q */
/*
 * MIN (RWC)
 *
 * Min value of  q_channel, write clear
 */
#define RDC_MIN_Q_MIN_MASK (0xFFFFFF00UL)
#define RDC_MIN_Q_MIN_SHIFT (8U)
#define RDC_MIN_Q_MIN_SET(x) (((uint32_t)(x) << RDC_MIN_Q_MIN_SHIFT) & RDC_MIN_Q_MIN_MASK)
#define RDC_MIN_Q_MIN_GET(x) (((uint32_t)(x) & RDC_MIN_Q_MIN_MASK) >> RDC_MIN_Q_MIN_SHIFT)

