RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_rdc_regs.h
/*
 * CNT_POS (RO)
 *
 * sample number during the positive of rectify signal
 * 1: 1
 * 2: 2
 * …
 */
#define RDC_ACC_CNT_I_CNT_POS_MASK (0xFFFFU)
#define RDC_ACC_CNT_I_CNT_POS_SHIFT (0U)
#define RDC_ACC_CNT_I_CNT_POS_GET(x) (((uint32_t)(x) & RDC_ACC_CNT_I_CNT_POS_MASK) >> RDC_ACC_CNT_I_CNT_POS_SHIFT)

/* Bitfield definition for register: SIGN_CNT_I */
/*
 * CNT_NEG (RO)
 *
 * Positive sample counter during negative rectify signal
 */
#define RDC_SIGN_CNT_I_CNT_NEG_MASK (0xFFFF0000UL)
#define RDC_SIGN_CNT_I_CNT_NEG_SHIFT (16U)
#define RDC_SIGN_CNT_I_CNT_NEG_GET(x) (((uint32_t)(x) & RDC_SIGN_CNT_I_CNT_NEG_MASK) >> RDC_SIGN_CNT_I_CNT_NEG_SHIFT)

/*
 * CNT_POS (RO)
 *
 * Negative sample counter during positive rectify signal
 */
#define RDC_SIGN_CNT_I_CNT_POS_MASK (0xFFFFU)
#define RDC_SIGN_CNT_I_CNT_POS_SHIFT (0U)
#define RDC_SIGN_CNT_I_CNT_POS_GET(x) (((uint32_t)(x) & RDC_SIGN_CNT_I_CNT_POS_MASK) >> RDC_SIGN_CNT_I_CNT_POS_SHIFT)

/* Bitfield definition for register: SYNC_DELAY_Q */
/*
 * DELAY (RW)
 *
 * Delay  in clock cycle for synchronous signal, the value shoud less than half of exc_period.exc_period.
 * 0: invalid value
 * 1: 1 cycles
 * 2: 2 cycles
 * ...
 */
#define RDC_SYNC_DELAY_Q_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_SYNC_DELAY_Q_DELAY_SHIFT (0U)
#define RDC_SYNC_DELAY_Q_DELAY_SET(x) (((uint32_t)(x) << RDC_SYNC_DELAY_Q_DELAY_SHIFT) & RDC_SYNC_DELAY_Q_DELAY_MASK)
#define RDC_SYNC_DELAY_Q_DELAY_GET(x) (((uint32_t)(x) & RDC_SYNC_DELAY_Q_DELAY_MASK) >> RDC_SYNC_DELAY_Q_DELAY_SHIFT)

/* Bitfield definition for register: RISE_DELAY_Q */
/*
 * RISE_DELAY (RO)
 *
 * Delay value on rising edge of  q_channel data
 * 0: 1 cycle
 * 1: 2 cycles
 * …
 */
#define RDC_RISE_DELAY_Q_RISE_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_RISE_DELAY_Q_RISE_DELAY_SHIFT (0U)
#define RDC_RISE_DELAY_Q_RISE_DELAY_GET(x) (((uint32_t)(x) & RDC_RISE_DELAY_Q_RISE_DELAY_MASK) >> RDC_RISE_DELAY_Q_RISE_DELAY_SHIFT)

/* Bitfield definition for register: FALL_DELAY_Q */
/*
 * FALL_DELAY (RO)
 *
 * Delay value on falling edge of  q_channel data
 * 0: 1 cycle
 * 1: 2 cycles
 * …
 */
#define RDC_FALL_DELAY_Q_FALL_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_FALL_DELAY_Q_FALL_DELAY_SHIFT (0U)
#define RDC_FALL_DELAY_Q_FALL_DELAY_GET(x) (((uint32_t)(x) & RDC_FALL_DELAY_Q_FALL_DELAY_MASK) >> RDC_FALL_DELAY_Q_FALL_DELAY_SHIFT)

/* Bitfield definition for register: SAMPLE_RISE_Q */
/*
 * VALUE (RO)
 *
 * sample value on rising edge of rectify signal
 */
#define RDC_SAMPLE_RISE_Q_VALUE_MASK (0xFFFFFF00UL)
#define RDC_SAMPLE_RISE_Q_VALUE_SHIFT (8U)
#define RDC_SAMPLE_RISE_Q_VALUE_GET(x) (((uint32_t)(x) & RDC_SAMPLE_RISE_Q_VALUE_MASK) >> RDC_SAMPLE_RISE_Q_VALUE_SHIFT)

/* Bitfield definition for register: SAMPLE_FALL_Q */
/*
 * VALUE (RO)
 *
 * sample value on falling edge of rectify signal
 */
#define RDC_SAMPLE_FALL_Q_VALUE_MASK (0xFFFFFF00UL)
#define RDC_SAMPLE_FALL_Q_VALUE_SHIFT (8U)
#define RDC_SAMPLE_FALL_Q_VALUE_GET(x) (((uint32_t)(x) & RDC_SAMPLE_FALL_Q_VALUE_MASK) >> RDC_SAMPLE_FALL_Q_VALUE_SHIFT)

/* Bitfield definition for register: ACC_CNT_Q */
/*
 * CNT_NEG (RO)
 *
 * sample number during the negtive of rectify signal
 * 1: 1
 * 2: 2
 * …
 */
#define RDC_ACC_CNT_Q_CNT_NEG_MASK (0xFFFF0000UL)
#define RDC_ACC_CNT_Q_CNT_NEG_SHIFT (16U)
#define RDC_ACC_CNT_Q_CNT_NEG_GET(x) (((uint32_t)(x) & RDC_ACC_CNT_Q_CNT_NEG_MASK) >> RDC_ACC_CNT_Q_CNT_NEG_SHIFT)

/*
 * CNT_POS (RO)
 *
 * sample number during the positive of rectify signal
 * 1: 1
 * 2: 2
 * …
 */
#define RDC_ACC_CNT_Q_CNT_POS_MASK (0xFFFFU)
#define RDC_ACC_CNT_Q_CNT_POS_SHIFT (0U)
#define RDC_ACC_CNT_Q_CNT_POS_GET(x) (((uint32_t)(x) & RDC_ACC_CNT_Q_CNT_POS_MASK) >> RDC_ACC_CNT_Q_CNT_POS_SHIFT)

/* Bitfield definition for register: SIGN_CNT_Q */
/*
 * CNT_NEG (RO)
 *
 * Positive sample counter during negative rectify signal
 */
#define RDC_SIGN_CNT_Q_CNT_NEG_MASK (0xFFFF0000UL)
#define RDC_SIGN_CNT_Q_CNT_NEG_SHIFT (16U)
#define RDC_SIGN_CNT_Q_CNT_NEG_GET(x) (((uint32_t)(x) & RDC_SIGN_CNT_Q_CNT_NEG_MASK) >> RDC_SIGN_CNT_Q_CNT_NEG_SHIFT)

/*
 * CNT_POS (RO)
 *
 * Negative sample counter during positive rectify signal
 */
#define RDC_SIGN_CNT_Q_CNT_POS_MASK (0xFFFFU)
#define RDC_SIGN_CNT_Q_CNT_POS_SHIFT (0U)
#define RDC_SIGN_CNT_Q_CNT_POS_GET(x) (((uint32_t)(x) & RDC_SIGN_CNT_Q_CNT_POS_MASK) >> RDC_SIGN_CNT_Q_CNT_POS_SHIFT)

/* Bitfield definition for register: AMP_MAX */
/*
 * MAX (RW)
 *
 * the maximum of acc amplitude
 */
#define RDC_AMP_MAX_MAX_MASK (0xFFFFFFFFUL)
#define RDC_AMP_MAX_MAX_SHIFT (0U)
#define RDC_AMP_MAX_MAX_SET(x) (((uint32_t)(x) << RDC_AMP_MAX_MAX_SHIFT) & RDC_AMP_MAX_MAX_MASK)
#define RDC_AMP_MAX_MAX_GET(x) (((uint32_t)(x) & RDC_AMP_MAX_MAX_MASK) >> RDC_AMP_MAX_MAX_SHIFT)

/* Bitfield definition for register: AMP_MIN */
/*
 * MIN (RW)
 *
 * the minimum of acc amplitude
 */
#define RDC_AMP_MIN_MIN_MASK (0xFFFFFFFFUL)
#define RDC_AMP_MIN_MIN_SHIFT (0U)
#define RDC_AMP_MIN_MIN_SET(x) (((uint32_t)(x) << RDC_AMP_MIN_MIN_SHIFT) & RDC_AMP_MIN_MIN_MASK)
#define RDC_AMP_MIN_MIN_GET(x) (((uint32_t)(x) & RDC_AMP_MIN_MIN_MASK) >> RDC_AMP_MIN_MIN_SHIFT)

/* Bitfield definition for register: INT_EN */
/*
 * INT_EN (RW)
 *
 * enable interrupt output
 */
#define RDC_INT_EN_INT_EN_MASK (0x80000000UL)
#define RDC_INT_EN_INT_EN_SHIFT (31U)
#define RDC_INT_EN_INT_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_INT_EN_SHIFT) & RDC_INT_EN_INT_EN_MASK)
#define RDC_INT_EN_INT_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_INT_EN_MASK) >> RDC_INT_EN_INT_EN_SHIFT)

/*
 * ACC_VLD_I_EN (RW)
 *
 * i_channel accumulate valid interrupt enable for i_channel
 */
#define RDC_INT_EN_ACC_VLD_I_EN_MASK (0x8000U)
#define RDC_INT_EN_ACC_VLD_I_EN_SHIFT (15U)
#define RDC_INT_EN_ACC_VLD_I_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_VLD_I_EN_SHIFT) & RDC_INT_EN_ACC_VLD_I_EN_MASK)
#define RDC_INT_EN_ACC_VLD_I_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_VLD_I_EN_MASK) >> RDC_INT_EN_ACC_VLD_I_EN_SHIFT)

/*
 * ACC_VLD_Q_EN (RW)
 *
 * q_channel accumulate valid interrupt enable for i_channel
 */
#define RDC_INT_EN_ACC_VLD_Q_EN_MASK (0x4000U)
#define RDC_INT_EN_ACC_VLD_Q_EN_SHIFT (14U)
#define RDC_INT_EN_ACC_VLD_Q_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_VLD_Q_EN_SHIFT) & RDC_INT_EN_ACC_VLD_Q_EN_MASK)
#define RDC_INT_EN_ACC_VLD_Q_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_VLD_Q_EN_MASK) >> RDC_INT_EN_ACC_VLD_Q_EN_SHIFT)

