RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_rdc_regs.h
/*
 * ACC_VLD_Q_STA (W1C)
 *
 * q_channel accumulate valid interrupt status for i_channel
 */
#define RDC_ADC_INT_STATE_ACC_VLD_Q_STA_MASK (0x4000U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_STA_SHIFT (14U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_Q_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_Q_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_Q_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_Q_STA_SHIFT)

/*
 * RISING_DELAY_I_STA (W1C)
 *
 * i_channel delayed rectify signal rising edge interrupt status
 */
#define RDC_ADC_INT_STATE_RISING_DELAY_I_STA_MASK (0x2000U)
#define RDC_ADC_INT_STATE_RISING_DELAY_I_STA_SHIFT (13U)
#define RDC_ADC_INT_STATE_RISING_DELAY_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_RISING_DELAY_I_STA_SHIFT) & RDC_ADC_INT_STATE_RISING_DELAY_I_STA_MASK)
#define RDC_ADC_INT_STATE_RISING_DELAY_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_RISING_DELAY_I_STA_MASK) >> RDC_ADC_INT_STATE_RISING_DELAY_I_STA_SHIFT)

/*
 * FALLING_DELAY_I_STA (W1C)
 *
 * i_channel delayed rectify signal falling edge interrupt status
 */
#define RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_MASK (0x1000U)
#define RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_SHIFT (12U)
#define RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_SHIFT) & RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_MASK)
#define RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_MASK) >> RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_SHIFT)

/*
 * RISING_DELAY_Q_STA (W1C)
 *
 * q_channel delayed rectify signal rising edge interrupt status
 */
#define RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_MASK (0x800U)
#define RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_SHIFT (11U)
#define RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_SHIFT) & RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_MASK)
#define RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_MASK) >> RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_SHIFT)

/*
 * FALLING_DELAY_Q_STA (W1C)
 *
 * q_channel delayed rectify signal falling edge interrupt status
 */
#define RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_MASK (0x400U)
#define RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_SHIFT (10U)
#define RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_SHIFT) & RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_MASK)
#define RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_MASK) >> RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_SHIFT)

/*
 * SAMPLE_RISING_I_STA (W1C)
 *
 * i_channel rising edge interrupt status
 */
#define RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_MASK (0x200U)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_SHIFT (9U)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_SHIFT) & RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_MASK)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_MASK) >> RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_SHIFT)

/*
 * SAMPLE_FALLING_I_STA (W1C)
 *
 * i_channel falling edge interrupt status
 */
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_MASK (0x100U)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_SHIFT (8U)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_SHIFT) & RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_MASK)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_MASK) >> RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_SHIFT)

/*
 * SAMPLE_RISING_Q_STA (W1C)
 *
 * q_channel rising edge interrupt status
 */
#define RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_MASK (0x80U)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_SHIFT (7U)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_SHIFT) & RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_MASK)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_MASK) >> RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_SHIFT)

/*
 * SAMPLE_FALLING_Q_STA (W1C)
 *
 * q_channel falling edge interrupt status
 */
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_MASK (0x40U)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_SHIFT (6U)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_SHIFT) & RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_MASK)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_MASK) >> RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_SHIFT)

/*
 * ACC_VLD_I_OVH_STA (W1C)
 *
 * i_channel accumulate overflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_MASK (0x20U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_SHIFT (5U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_SHIFT)

/*
 * ACC_VLD_Q_OVH_STA (W1C)
 *
 * q_channel accumulate overflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_MASK (0x10U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_SHIFT (4U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_SHIFT)

/*
 * ACC_VLD_I_OVL_STA (W1C)
 *
 * i_channel accumulate underflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_MASK (0x8U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_SHIFT (3U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_SHIFT)

