RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_rdc_regs.h
/*
 * ACC_VLD_Q_OVL_STA (W1C)
 *
 * q_channel accumulate underflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_MASK (0x4U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_SHIFT (2U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_SHIFT)

/*
 * ACC_AMP_OVH_STA (W1C)
 *
 * accumulate ample overflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_MASK (0x2U)
#define RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_SHIFT (1U)
#define RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_MASK) >> RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_SHIFT)

/*
 * ACC_AMP_OVL_STA (W1C)
 *
 * accumulate ample underflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_MASK (0x1U)
#define RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_SHIFT (0U)
#define RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_MASK) >> RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_SHIFT)




#endif /* HPM_RDC_H */
